InformationRegisters/РезультатыПроверкиСредствамиККТИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РезультатыПроверкиСредствамиККТИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРезультатаПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМаркировкиПроверен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработкиЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРезультатаПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультаПроверкиОИСМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветОИСМОСтатусеТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПолныйКодМаркировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУпаковокИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеФискальнойОперацииИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШтрихкодУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РезультатыПроверкиСредствамиККТИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеРезультатовПроверкиДляПроверкиИПодбора(СсылкаНаДокумент) Экспорт
	
	ВозвращаемоеЗначение = Новый Соответствие();
	
	ТекстЗапросаПлатежныхДокументов = Неопределено;
	ИнтеграцияИСМППереопределяемый.ПриОпределенииТекстаЗапросаПлатежныхДокументовПоДокументуПродажиИлиВозврата(
		СсылкаНаДокумент,
		ТекстЗапросаПлатежныхДокументов);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&СсылкаНаДокумент КАК СсылкаНаДокумент
		|ПОМЕСТИТЬ СсылкиНаДокументы
		|
		|"
		+ ?(ЗначениеЗаполнено(ТекстЗапросаПлатежныхДокументов),
		"ОБЪЕДИНИТЬ ВСЕ
		|
		|" + ТекстЗапросаПлатежныхДокументов, "") +
		"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатыПроверкиСредствамиККТИСМП.Документ,
		|	РезультатыПроверкиСредствамиККТИСМП.ШтрихкодУпаковки,
		|	РезультатыПроверкиСредствамиККТИСМП.ВидУпаковки,
		|	РезультатыПроверкиСредствамиККТИСМП.КодРезультатаПроверки,
		|	РезультатыПроверкиСредствамиККТИСМП.КодМаркировкиПроверен,
		|	РезультатыПроверкиСредствамиККТИСМП.КодОбработкиЗапроса,
		|	РезультатыПроверкиСредствамиККТИСМП.ПредставлениеРезультатаПроверки,
		|	РезультатыПроверкиСредствамиККТИСМП.РезультатПроверки,
		|	РезультатыПроверкиСредствамиККТИСМП.РезультаПроверкиОИСМ,
		|	РезультатыПроверкиСредствамиККТИСМП.СтатусТовара,
		|	РезультатыПроверкиСредствамиККТИСМП.ТребуетсяПолныйКодМаркировки
		|ИЗ
		|	РегистрСведений.РезультатыПроверкиСредствамиККТИСМП КАК РезультатыПроверкиСредствамиККТИСМП
		|ГДЕ
		|	РезультатыПроверкиСредствамиККТИСМП.Документ В
		|		(ВЫБРАТЬ
		|			СсылкиНаДокументы.СсылкаНаДокумент
		|		ИЗ
		|			СсылкиНаДокументы КАК СсылкиНаДокументы)";
	
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КешЗначенийШтрихкода   = Новый Соответствие();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДанныеПроверки = ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ДанныеПредставленияРезультатовПроверкиСредствамиККТ(
			ВыборкаДетальныеЗаписи, Ложь, Ложь);
		
		Если Не ДанныеПроверки.ЕстьОшибки Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеШтрихкода = СокрЛП(ВыборкаДетальныеЗаписи.ШтрихкодУпаковки);
		ДанныеВКеше       = КешЗначенийШтрихкода[ЗначениеШтрихкода];
		Если ДанныеВКеше <> Неопределено Тогда
			МоментВремени      = ВыборкаДетальныеЗаписи.Документ.МоментВремени();
			МоментВремениВКеше = ДанныеВКеше.МоментВремени();
			СравнениеЗначений = Новый СравнениеЗначений();
			Если СравнениеЗначений.Сравнить(МоментВремени, МоментВремениВКеше) < 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ВозвращаемоеЗначение.Вставить(ЗначениеШтрихкода, ДанныеПроверки);
		КешЗначенийШтрихкода.Вставить(ЗначениеШтрихкода, ВыборкаДетальныеЗаписи.Документ);
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецЕсли
